
{

"unit1": {
    "title": "Unit 1: Hajin's Diary (ハジンの日記)",
    "parts": [
      {
        "partTitle": "Part 1: 元気だった？",
        "en": "Hajin came back from his trip to Korea. He visited his grandparents in Busan and saw his friends in Seoul. They were very interested in Japan. Now, Tina, Eri, Kota, and Hajin are all in the same class.",
        "jp": "ハジンが韓国旅行から帰ってきました。彼はプサンの祖父母を訪ね、ソウルの友人たちにも会いました。彼らは日本にとても興味を持っていました。今年、ティナ、エリ、コウタ、ハジンはみんな同じクラスになりました。",
        "full_en": "Tina: We're all in the same class this year.\nEri: Yeah. Isn't it great?\nKota: Look! Hajin's here.\nHajin: Hi! Long time no see.\nEri: Good to see you.\nTina: How was your trip to Korea?\nHajin: It was great. I went to Busan. I visited my grandparents. We met for the first time in half a year.\nEri: What else?\nHajin: I saw my friends in Seoul. They were really interested in Japan.",
        "full_jp": "ティナ：私たちは今年、みんな同じクラスね。\nエリ：ええ。最高じゃない？\nコウタ：見て！ ハジンがいるよ。\nハジン：やあ！ 久しぶりだね。\nエリ：会えてうれしいわ。\nティナ：韓国への旅行はどうだった？\nハジン：よかったよ。僕はプサンへ行ったんだ。祖父母を訪ねたよ。半年ぶりに会ったんだ。\nエリ：他には？\nハジン：ソウルで友達に会ったよ。彼らは日本にとても興味を持っていたよ。",
        "vocab": [
          "same (同じ)",
          "trip (旅行)",
          "half (半分)",
          "else (そのほかに)",
          "Long time no see. (久しぶり。)",
          "for the first time (初めて)",
          "be interested in (～に興味がある)"
        ],
        "grammar": "【過去形】go → went, visit → visited などの一般動詞の過去形や、is → was などのbe動詞の過去形を使って、過去の出来事を表します。",
        "ox_quiz": [
          {
            "q_en": "Hajin visited his grandparents in Korea.",
            "q_jp": "ハジンは韓国で祖父母を訪ねましたか？",
            "a": "〇",
            "exp": "はい。「プサンへ行った。祖父母を訪ねた」と話しています。"
          },
          {
            "q_en": "This is the first time for Hajin to meet his grandparents.",
            "q_jp": "ハジンが祖父母に会うのは、これが初めてですか？",
            "a": "×",
            "exp": "いいえ。「半年ぶりに（for the first time in half a year）会った」と言っているので、初めてではありません。"
          }
        ]
      },
      {
        "partTitle": "Part 2: ハジンへの頼みごと",
        "en": "Eri was looking for Hajin. She found him studying in the library. Eri asked Hajin to coach their class for the basketball tournament next month. Hajin was surprised but he accepted the offer.",
        "jp": "エリはハジンを探していました。彼女は図書室で勉強している彼を見つけました。エリは来月のバスケットボール大会に向けて、クラスのコーチをしてほしいとハジンに頼みました。ハジンは驚きましたが、その申し出を引き受けました。",
        "full_en": "Eri: There you are! I was looking for you. What were you doing?\nHajin: I was studying. When I have free time, I often study Japanese here. Kanji are really hard.\nEri: I know. By the way, the school basketball tournament is next month, right?\nHajin: That's right.\nEri: Can you coach the other students in the class?\nHajin: Me?\nEri: Yes, you! You're our choice.\nHajin: Sure. What an honor!",
        "full_jp": "エリ：そこにいたのね！ あなたを探していたのよ。何をしていたの？\nハジン：勉強していたんだ。暇な時間があるとき、僕はよくここで日本語を勉強するんだ。漢字は本当に難しいね。\nエリ：わかるわ。ところで、学校のバスケットボール大会が来月あるでしょ？\nハジン：そうだね。\nエリ：クラスの他の生徒たちのコーチをしてくれない？\nハジン：僕が？\nエリ：そう、あなたよ！ 私たちが選んだの。\nハジン：もちろん。なんて光栄なんだ！",
        "vocab": [
          "tournament (大会)",
          "coach (コーチをする)",
          "other (他の)",
          "choice (選択)",
          "honor (光栄)",
          "look for (～を探す)",
          "free time (暇な時間)"
        ],
        "grammar": "【接続詞 when】「When + 主語 + 動詞」で「〜するとき」という時を表すまとまりを作ります。例：When I have free time（暇な時間があるとき）。",
        "ox_quiz": [
          {
            "q_en": "Hajin thinks Kanji are very easy.",
            "q_jp": "ハジンは漢字はとても簡単だと思っていますか？",
            "a": "×",
            "exp": "いいえ。「漢字は本当に難しい（really hard）」と言っています。"
          },
          {
            "q_en": "The basketball tournament will be held next month.",
            "q_jp": "バスケットボール大会は来月開催されますか？",
            "a": "〇",
            "exp": "はい。「バスケットボール大会が来月あるでしょ？」というエリの問いにハジンが同意しています。"
          }
        ]
      },
      {
        "partTitle": "Part 3: ハジンの日記",
        "en": "Hajin wrote about his day in his diary. He is in the same class with his friends. Everyone liked his gifts from Korea. He accepted the offer to coach the basketball team and wants to show the joy of the sport to everyone.",
        "jp": "ハジンはその日の出来事を日記に書きました。彼は友達と同じクラスになりました。みんな韓国からの彼のお土産を気に入ってくれました。彼はバスケットボールチームのコーチの申し出を引き受け、みんなにスポーツの楽しさを教えたいと思っています。",
        "full_en": "Thursday, April 6 (sunny)\nIt was a good day today. Kota, Tina, Eri, and I are all in the same class. Everyone liked my gifts from Korea. They all looked happy. Awesome!\nAfter school, Eri and I talked about the basketball tournament. She asked me about coaching. I was surprised at first, but I accepted the offer. It sounds exciting. I want to show the joy of basketball to everyone.",
        "full_jp": "4月6日 木曜日（晴れ）\n今日は良い日だった。コウタ、ティナ、エリ、そして僕はみんな同じクラスだ。みんな韓国からのお土産を気に入ってくれた。彼らはみんな幸せそうに見えた。最高だ！\n放課後、エリと僕はバスケットボール大会について話した。彼女は僕にコーチをすることについて頼んできた。最初は驚いたけれど、その申し出を受けた。面白そうだね。僕はみんなにバスケットボールの楽しさを教えたい。",
        "vocab": [
          "sunny (晴れ)",
          "awesome (最高)",
          "surprised (驚いた)",
          "accept (受け入れる)",
          "offer (申し出)",
          "joy (喜び)",
          "at first (最初は)"
        ],
        "grammar": "【look / sound + 形容詞】「〜そうに見える / 〜そうに聞こえる（思える）」という意味です。例：They looked happy.（彼らは幸せそうに見えました）。",
        "ox_quiz": [
          {
            "q_en": "Hajin's friends looked happy with the gifts from Korea.",
            "q_jp": "ハジンの友達は韓国からのお土産をもらって幸せそうに見えましたか？",
            "a": "〇",
            "exp": "はい。「みんなお土産を気に入ってくれた。幸せそうに見えた」と日記にあります。"
          }
        ]
      },
      {
        "partTitle": "Goal: 日記を書こう",
        "en": "Kota and Tina also wrote diaries. Kota made breakfast by himself, but it was not good. At the movie theater, they met Tina and Nick. Kota is reading a magazine, but he is not as excited as Hajin about the tournament.",
        "jp": "コウタとティナも日記を書きました。コウタは自分で朝食を作りましたが、美味しくありませんでした。映画館で、彼らはティナとニックに会いました。コウタは雑誌を読んでいますが、ハジンのように大会にワクワクしてはいません。",
        "full_en": "(Kota's Diary)\nIn the morning, I made breakfast by myself. It was not good. In the afternoon, I went to a movie with Hajin. When we were ordering drinks, Tina came up to us. We had a good time. In the evening, I read a basketball magazine. Hajin lent it to me. He is excited about the tournament, but I'm not.",
        "full_jp": "（コウタの日記）\n朝、僕は自分で朝食を作った。美味しくなかった。午後、僕はハジンと映画に行った。僕たちが飲み物を注文していた時、ティナが僕たちのところにやってきた。僕たちは楽しい時を過ごした。夕方、僕はバスケットボールの雑誌を読んだ。ハジンがそれを貸してくれた。彼は大会にワクワクしているけれど、僕はそうでもない。",
        "vocab": [
          "myself (私自身/自分で)",
          "order (注文する)",
          "lend (貸す)",
          "come up to (〜のところにやってくる)",
          "have a good time (楽しい時を過ごす)"
        ],
        "grammar": "【過去進行形】「was/were + 〜ing」で「（そのとき）〜していました」という動作の最中であることを表します。例：When we were ordering drinks...（飲み物を注文していた時）。",
        "ox_quiz": [
          {
            "q_en": "Kota enjoyed the breakfast he made.",
            "q_jp": "コウタは自分で作った朝食を楽しみましたか？",
            "a": "×",
            "exp": "いいえ。「美味しくなかった（It was not good）」と書いています。"
          },
          {
            "q_en": "Hajin lent a basketball magazine to Kota.",
            "q_jp": "ハジンはコウタにバスケットボールの雑誌を貸しましたか？",
            "a": "〇",
            "exp": "はい。「ハジンがそれを貸してくれた（Hajin lent it to me）」とあります。"
          }
        ]
      }
    ]
  },


"unit2": {
    "title": "Unit 2: Basketball Tournament (球技大会)",
    "parts": [
      {
        "partTitle": "Part 1: 大会まであと1週間",
        "en": "Kota does not like playing basketball because he is not good at passing. Hajin encourages him, saying practice is needed. Later, on the way home, Tina tells Kota that she saw him practicing hard at the gym and encourages him.",
        "jp": "コウタはパスが苦手なので、バスケットボールをするのが好きではありません。ハジンは練習が必要だと言って彼を励まします。その後、帰り道でティナは、体育館でコウタが一生懸命練習しているのを見たと伝え、彼を励まします。",
        "full_en": "(At the gym)\nKota: I don't like playing basketball. I'm not good at passing the ball.\nHajin: No problem. For beginners, passing the ball isn't easy. But it's all right. You just need some practice.\n(On the way home)\nTina: Are you nervous about the game?\nKota: Actually, yes. A little bit.\nTina: Don't worry. I saw you at the gym today. You were doing great.",
        "full_jp": "（体育館にて）\nコウタ：僕はバスケットボールをするのが好きではありません。ボールをパスするのが得意ではないんです。\nハジン：問題ないよ。初心者にとって、ボールをパスすることは簡単ではないんだ。でも大丈夫。ちょっと練習が必要なだけだよ。\n（帰り道にて）\nティナ：試合のこと、不安に思ってる？\nコウタ：実は、うん。少しね。\nティナ：心配しないで。今日体育館であなたを見ていたわ。すごくよくやっていたよ。",
        "vocab": [
          "pass (パスする)",
          "beginner (初心者)",
          "easy (簡単な)",
          "actually (実は)",
          "problem (問題)",
          "nervous (不安な/緊張して)",
          "worry (心配する)",
          "be good at (～が得意である)"
        ],
        "grammar": "【動動詞 (ing)】動詞に ing をつけることで、「〜すること」という名詞の働きをさせます。前置詞（at など）の後ろでも使われます。",
        "ox_quiz": [
          {
            "q_en": "Kota is good at passing the ball.",
            "q_jp": "コウタはボールをパスするのが得意ですか？",
            "a": "×",
            "exp": "いいえ。「パスをするのが得意ではない（not good at passing）」と言っています。"
          },
          {
            "q_en": "Tina saw Kota at the gym today.",
            "q_jp": "ティナは今日、体育館でコウタを見ましたか？",
            "a": "〇",
            "exp": "はい。「今日体育館であなたを見ていたわ」と話しています。"
          }
        ]
      },
      {
        "partTitle": "Part 2: もう1点！",
        "en": "During the game, the team needs more points. Hajin wants to shoot, but the other team is trying to stop him. The important thing is to pass the ball. Finally, Kota makes a nice pass to Hajin and it works.",
        "jp": "試合中、チームはもっと得点を必要としています。ハジンはシュートを打ちたいと思っていますが、相手チームが彼を止めようとしています。大切なのはパスを出すことです。ついにコウタがハジンにナイスパスを出し、それがうまくいきます。",
        "full_en": "Eri: Look. We only have one more minute.\nTina: We need more points. Hajin wants to shoot.\nTina: Yes. The important thing is to pass the ball to Hajin.\nEri: It's not easy. They're trying to stop him.\nTina: Look! It worked. Nice pass, Kota!\nEri: Go, Hajin!",
        "full_jp": "エリ：見て。あと1分しかないわ。\nティナ：もっと点が必要ね。ハジンはシュートしたがってるわ。\nティナ：そうね。重要なことは、ハジンにボールをパスすることよ。\nエリ：それは簡単じゃないわ。彼らは彼を止めようとしているもの。\nティナ：見て！ うまくいった！ ナイスパス、コウタ！\nエリ：行け、ハジン！",
        "vocab": [
          "point (得点/ポイント)",
          "shoot (シュートする)",
          "important (重要な/大切な)",
          "stop (止める)",
          "try to (～しようとする)",
          "It worked. (うまくいった。)"
        ],
        "grammar": "【不定詞の名詞的用法】「to + 動詞の原形」で、「〜すること」という意味の名詞のまとまりを作ります。",
        "ox_quiz": [
          {
            "q_en": "There is only one minute left in the game.",
            "q_jp": "試合の残りの時間はあと1分だけですか？",
            "a": "〇",
            "exp": "はい。「あと1分しかない（only have one more minute）」とエリが言っています。"
          },
          {
            "q_en": "Hajin passed the ball to Kota at the end.",
            "q_jp": "最後にハジンがコウタにボールをパスしましたか？",
            "a": "×",
            "exp": "いいえ。「ナイスパス、コウタ！」と言われているので、パスを出したのはコウタです。"
          }
        ]
      },
      {
        "partTitle": "Part 3: 試合の結果は…",
        "en": "After the game, everyone is happy. Mr. Hoshino is sure that the students like basketball now. Kota thanks Hajin for coaching. Hajin tells Kota that he made much progress and he always believed in him.",
        "jp": "試合の後、みんな喜んでいます。星野先生は、生徒たちが今ではバスケットボールが好きだと確信しています。コウタはコーチをしてくれたハジンに感謝します。ハジンはコウタに、すごく上達したと言い、いつも彼を信じていたと伝えます。",
        "full_en": "Eri: Congratulations!\nTina: You did it!\nEri: I think that you guys did a great job.\nMr. Hoshino: I am sure that you like playing basketball now.\nKota: Yeah, thanks to our coach, Hajin!\nHajin: Thanks. Kota, you made so much progress. I always believed that you could do it.\nEri: Practice makes perfect.\nTina: We're so proud of you all!",
        "full_jp": "エリ：おめでとう！\nティナ：やったね！\nエリ：あなたたち、素晴らしい仕事をした（頑張った）と思うわ。\n星野先生：君たちは今、バスケットボールをするのが好きになっていると確信しているよ。\nコウタ：はい、僕らのコーチ、ハジンのおかげです！\nハジン：ありがとう。コウタ、君はすごく上達したよ。僕は君ができるっていつも信じていたよ。\nエリ：「習うより慣れろ（練習は嘘をつかない）」ね。\nティナ：私たち、みんなのことを誇りに思うわ！",
        "vocab": [
          "congratulations (おめでとう)",
          "job (仕事/務め)",
          "progress (進歩/上達)",
          "believe (信じる)",
          "could (できた)",
          "proud (誇りに思う)",
          "thanks to (～のおかげで)",
          "be proud of (～を誇りに思う)"
        ],
        "grammar": "【接続詞 that】think や know などの動詞の後に that を続けることで、「〜ということ」という内容を説明する節を作ります。",
        "ox_quiz": [
          {
            "q_en": "Mr. Hoshino thinks the students hate basketball.",
            "q_jp": "星野先生は、生徒たちがバスケットボールを嫌っていると思っていますか？",
            "a": "×",
            "exp": "いいえ。「バスケットボールをするのが好きになっていると確信している」と言っています。"
          },
          {
            "q_en": "Hajin says Kota improved his basketball skills.",
            "q_jp": "ハジンはコウタのバスケットボールの技術が上達したと言っていますか？",
            "a": "〇",
            "exp": "はい。「君はすごく上達した（made so much progress）」と褒めています。"
          }
        ]
      },
      {
        "partTitle": "Goal: 学級レクリエーション",
        "en": "Kota wants to play basketball for the class recreation. He thinks that the most important thing is to have fun together.",
        "jp": "コウタは学級レクリエーションでバスケットボールをしたいと考えています。彼は、最も大切なことは一緒に楽しむことだと思っています。",
        "full_en": "Interviewer: What do you want to do?\nKota: I want to play basketball.\nInterviewer: Why?\nKota: Because I think the important thing is to have fun together.",
        "full_jp": "面接官：あなたは何をしたいですか？\nコウタ：僕はバスケットボールがしたいです。\n面接官：なぜですか？\nコウタ：なぜなら、大切なことは一緒に楽しむことだと思うからです。",
        "vocab": [
          "recreation (レクリエーション)",
          "quiz (クイズ)",
          "understand (理解する)",
          "each other (お互い)",
          "something new (何か新しいこと)",
          "have fun (楽しむ)"
        ],
        "grammar": "【重要表現の組み合わせ】want to（〜したい）や because（なぜなら）、不定詞（to have fun）などを組み合わせて自分の意見を伝えます。",
        "ox_quiz": [
          {
            "q_en": "Kota wants to do a quiz for the recreation.",
            "q_jp": "コウタはレクリエーションでクイズをしたいですか？",
            "a": "×",
            "exp": "いいえ。「バスケットボールがしたい」と言っています。"
          },
          {
            "q_en": "Kota thinks having fun together is important.",
            "q_jp": "コウタは一緒に楽しむことが大切だと思っていますか？",
            "a": "〇",
            "exp": "はい。「大切なことは一緒に楽しむこと（important thing is to have fun together）」だと述べています。"
          }
        ]
      }
    ]
  },

"unit3": {
    "title": "Unit 3: Plans for the Summer (夏の計画)",
    "parts": [
      {
        "partTitle": "Part 1: もうすぐ夏休み",
        "en": "Tina asks about summer plans. Hajin will stay for a basketball tournament. Eri will visit her cousins in Okinawa. Tina is going to visit Singapore because her friend David invited her. Tina invites Kota to come with her.",
        "jp": "ティナが夏休みの予定を尋ねています。ハジンはバスケットボールの大会のためにここに残る予定です。エリは沖縄のいとこを訪ねる予定です。ティナは友人のデイビッドに誘われたのでシンガポールを訪れる予定で、コウタを一緒に来ないかと誘います。",
        "full_en": "Tina: Do you have any plans for the summer, guys?\nHajin: I am going to stay here. I have a basketball tournament.\nEri: I am going to visit my cousins in Okinawa.\nTina: I am going to visit Singapore this year. My friend David is going to visit his relatives in Singapore. He invited me.\nKota: I am jealous.\nTina: Why don't you come to Singapore with me?\nKota: Are you kidding?\nTina: I am serious. Let's ask David.",
        "full_jp": "ティナ：みんな、夏休みの何か計画はある？\nハジン：僕はここに残る予定だよ。バスケットボールの大会があるんだ。\nエリ：私は沖縄のいとこたちを訪ねる予定よ。\nティナ：私は今年シンガポールを訪れる予定なの。私の友達のデイビッドが、シンガポールの親戚を訪ねる予定なの。彼が私を招待してくれたのよ。\nコウタ：うらやましいな。\nティナ：私と一緒にシンガポールに来ない？\nコウタ：冗談だろ？\nティナ：本気よ。デイビッドに聞いてみましょう。",
        "vocab": [
          "plan (計画/予定)",
          "cousin (いとこ)",
          "relative (親戚)",
          "invite (招待する)",
          "jealous (うらやましい)",
          "someday (いつか)",
          "kidding (冗談を言っている)",
          "serious (本気の)"
        ],
        "grammar": "【be going to (～するつもりです)】be動詞 + going to + 動詞の原形 で、前もって決めていた計画や予定を表します。",
        "ox_quiz": [
          {
            "q_en": "Hajin is going to visit Okinawa this summer.",
            "q_jp": "ハジンはこの夏、沖縄を訪れる予定ですか？",
            "a": "×",
            "exp": "いいえ。ハジンはバスケットボールの大会のためにここに残る（stay here）予定です。"
          },
          {
            "q_en": "Tina invited Kota to go to Singapore together.",
            "q_jp": "ティナはコウタを一緒にシンガポールへ行こうと誘いましたか？",
            "a": "〇",
            "exp": "はい。「私と一緒にシンガポールに来ない？」と誘っています。"
          }
        ]
      },
      {
        "partTitle": "Part 2: 旅行に向けて",
        "en": "Kota reads an email from David. David asks if they are ready for the trip. He says it will be hot next week, so they should bring sunscreen. He will meet them at the airport.",
        "jp": "コウタがデイビッドからのメールを読んでいます。デイビッドは旅行の準備はできたか尋ねています。来週は暑くなるだろうから、日焼け止めを持ってくるようにと言っています。彼は空港で二人を出迎える予定です。",
        "full_en": "David: Hi Tina and Kota. Are you ready for your trip? Did you finish packing? It will be hot next week. So don't forget your sunscreen and sunglasses. By the way, when will your flight arrive? I'll meet you at the airport. I am looking forward to seeing you guys.",
        "full_jp": "デイビッド：やあ、ティナ、コウタ。旅行の準備はできた？ 荷造りは終わったかい？ 来週は暑くなるだろう。だから日焼け止めとサングラスを忘れないでね。ところで、あなたたちのフライトはいつ到着する予定だい？ 空港で出迎えるよ。みんなに会えるのを楽しみにしているよ。",
        "vocab": [
          "flight (フライト/航空便)",
          "pack (荷造りする)",
          "forget (忘れる)",
          "arrive (到着する)",
          "sunscreen (日焼け止め)",
          "look forward to (～を楽しみに待つ)"
        ],
        "grammar": "【助動詞 will (～でしょう)】will + 動詞の原形 で、未来の予測や、その場で決めた意志を表します。",
        "ox_quiz": [
          {
            "q_en": "David says it will be cold next week.",
            "q_jp": "デイビッドは来週は寒くなるだろうと言っていますか？",
            "a": "×",
            "exp": "いいえ。「暑くなるだろう（will be hot）」と言っています。"
          },
          {
            "q_en": "David will meet Tina and Kota at the airport.",
            "q_jp": "デイビッドは空港でティナとコウタを出迎えますか？",
            "a": "〇",
            "exp": "はい。「空港で出迎えるよ（I'll meet you at the airport）」と書いています。"
          }
        ]
      },
      {
        "partTitle": "Part 3: シンガポールにやって来た！",
        "en": "Tina and Kota arrive at Changi Airport. David welcomes them and asks about the flight. David says if they are tired, they can go home, or if they are hungry, they can go to Chinatown.",
        "jp": "ティナとコウタがチャンギ空港に到着しました。デイビッドが二人を歓迎し、フライトがどうだったか尋ねます。デイビッドは、もし疲れているなら家へ、もしお腹が空いているならチャイナタウンへ行こうと提案します。",
        "full_en": "David: Welcome to Singapore, both of you.\nTina: David! Good to see you.\nDavid: Same here. How was the flight?\nKota: It was a little scary but exciting.\nDavid: If you are tired, we can go straight home.\nTina: No, I am fine.\nDavid: If you are hungry, we can go to the food stall in Chinatown.\nKota: Excellent. I want to see the city.\nDavid: Of course. I'll show you around.",
        "full_jp": "デイビッド：シンガポールへようこそ、二人とも。\nティナ：デイビッド！ 会えて嬉しいわ。\nデイビッド：僕もだよ。フライトはどうだった？\nコウタ：少し怖かったけど、ワクワクしたよ。\nデイビッド：もし疲れているなら、まっすぐ家に帰ることができるよ。\nティナ：ううん、私は大丈夫。\nデイビッド：もしお腹が空いているなら、チャイナタウンの屋台に行くこともできるよ。\nコウタ：最高だね。街を見てみたいよ。\nデイビッド：もちろん。あちこち案内するよ。",
        "vocab": [
          "both (両方/二人とも)",
          "scary (怖い)",
          "tired (疲れた)",
          "hungry (お腹が空いた)",
          "stall (屋台)",
          "straight (まっすぐに)",
          "show around (案内して回る)"
        ],
        "grammar": "【接続詞 if (もし～ならば)】If + 文A, 文B. で「もしAならば、Bだ」という条件を表します。",
        "ox_quiz": [
          {
            "q_en": "Kota wants to go home because he is very tired.",
            "q_jp": "コウタはとても疲れているので家に帰りたがっていますか？",
            "a": "×",
            "exp": "いいえ。「街を見てみたい（I want to see the city）」と言っています。"
          },
          {
            "q_en": "David offers to go to Chinatown if they are hungry.",
            "q_jp": "デイビッドは、もしお腹が空いているならチャイナタウンへ行こうと提案していますか？",
            "a": "〇",
            "exp": "はい。「お腹が空いているなら、チャイナタウンの屋台に行けるよ」と言っています。"
          }
        ]
      },
      {
        "partTitle": "Goal: メールの返事を書こう",
        "en": "Kota replies to David's email. He tells David about the food he likes and what he wants to do. He likes vegetables but not fish. He wants to visit Merlion Park.",
        "jp": "コウタがデイビッドのメールに返信を書きます。好きな食べ物やしたいことについて伝えます。彼は野菜が好きですが魚は苦手であること、マーライオン公園に行きたいことを伝えています。",
        "full_en": "(David's Email): I will be at the arrival exit by 3 p.m. My uncle wants to know a few things for your stay. What food do you like? What do you want to do in Singapore? If you are worried about anything, please feel free to ask me.\n(Kota's Reply): I'll answer them. About 1: I like vegetables, but I don't like fish. About 2: I want to go to the Merlion Park with you.",
        "full_jp": "（デイビッドのメール）：午後3時までには到着出口にいるよ。おじさんが君の滞在のためにいくつか知りたいことがあるんだ。どんな食べ物が好き？ シンガポールで何がしたい？ もし何か心配なことがあれば、遠慮なく聞いてね。\n（コウタの返信）：質問に答えるね。1について：僕は野菜が好きだけど、魚は好きじゃないんだ。2について：君たちと一緒にマーライオン公園に行きたいな。",
        "vocab": [
          "reply (返事/返信する)",
          "exit (出口)",
          "uncle (おじ)",
          "worried (心配して)",
          "feel free to (遠慮なく～する)"
        ],
        "grammar": "【will や if の復習】「I will be at the arrival exit」や「If you are worried」など、学んだ未来や条件の表現を使ってやり取りをします。",
        "ox_quiz": [
          {
            "q_en": "Kota likes fish very much.",
            "q_jp": "コウタは魚が大好きですか？",
            "a": "×",
            "exp": "いいえ。「魚は好きじゃない（I don't like fish）」と答えています。"
          },
          {
            "q_en": "Kota wants to visit the Merlion Park.",
            "q_jp": "コウタはマーライオン公園を訪れたいと思っていますか？",
            "a": "〇",
            "exp": "はい。「君たちと一緒にマーライオン公園に行きたい」と返信しています。"
          }
        ]
      }
    ]
  },

"unit4": {
    "title": "Unit 4: Tour in Singapore (シンガポール旅行)",
    "parts": [
      {
        "partTitle": "Part 1: どこに行きたい？",
        "en": "Tina, Kota, and David are making a sightseeing plan at a cafe. Kota wants to see the Merlion, and David explains that there are several Merlions in Singapore. They decide to start from the Marina area and also visit Gardens by the Bay.",
        "jp": "ティナ、コウタ、デイビッドの3人がカフェで観光計画を立てています。コウタはマーライオンを見たいと言いますが、デイビッドはシンガポールにはいくつかのマーライオンがいると説明します。彼らはマリーナエリアから観光を始め、ガーデンズ・バイ・ザ・ベイにも行くことに決めました。",
        "full_en": "Tina: Let's make a sightseeing plan! What do you want to do first?\nKota: I want to see the Merlion.\nDavid: Sure, but which one? There are several Merlions.\nTina: Really? The big one by the bay, I guess.\nDavid: Sure. Let's start from the Marina area. There is a big one there.\nKota: Is there a big garden near there?\nDavid: Yeah, Gardens by the Bay.\nKota: I want to go there, too. I saw it on TV. It's so cool.\nTina: After that, I'd like to see the traditional part of the city.\nDavid: We can check out Arab Street later.",
        "full_jp": "ティナ：観光の計画を立てましょう！ 最初に何をしたい？\nコウタ：僕はマーライオンが見たいな。\nデイビッド：もちろん、でもどれだい？ マーライオンはいくつかあるんだよ。\nティナ：本当？ 湾のそばにある大きなやつだと思うわ。\nデイビッド：わかった。マリーナエリアから始めよう。そこには大きなやつがあるよ。\nコウタ：その近くに大きな庭（公園）はありますか？\nデイビッド：ああ、ガーデンズ・バイ・ザ・ベイだね。\nコウタ：僕もそこへ行きたい。テレビで見たんだ。すごくかっこいいよ。\nティナ：その後で、私は街の伝統的な部分を見てみたいな。\nデイビッド：後でアラブストリートに行ってみよう。",
        "vocab": [
          "sightseeing (観光)",
          "several (いくつかの)",
          "by (～のそばに)",
          "area (地域/エリア)",
          "traditional (伝統的な)",
          "check out (～を調べる/行ってみる)"
        ],
        "grammar": "【There is / There are】「～があります/～がいます」と、人や物の存在を伝える時に使います。単数なら is、複数なら are を使います。",
        "ox_quiz": [
          {
            "q_en": "There is only one Merlion in Singapore.",
            "q_jp": "シンガポールにはマーライオンは1つしかありませんか？",
            "a": "×",
            "exp": "いいえ。「マーライオンはいくつかある（several Merlions）」とデイビッドが言っています。"
          },
          {
            "q_en": "Kota saw Gardens by the Bay on TV.",
            "q_jp": "コウタはテレビでガーデンズ・バイ・ザ・ベイを見ましたか？",
            "a": "〇",
            "exp": "はい。「テレビで見たんだ。すごくかっこいいよ」と言っています。"
          }
        ]
      },
      {
        "partTitle": "Part 2: 迫力満点！",
        "en": "At Gardens by the Bay, Tina is amazed by the science fiction-like view. Kota explains that the gardens produce their own energy using Supertrees. David shows them the way to the walkway and mentions that the city has wheelchair access everywhere.",
        "jp": "ガーデンズ・バイ・ザ・ベイで、ティナはまるでSF映画のような光景に驚いています。コウタは、庭園がスーパーツリーを使って自分たちのエネルギーを作り出していることを説明します。デイビッドは歩道への道を案内し、この街にはあらゆる場所に車椅子用の通路があることを教えます。",
        "full_en": "Tina: This is amazing! It's like a science fiction movie! Show me your guidebook, please.\nKota: Here you are. It says the gardens produce their own energy.\nDavid: The Supertrees collect solar energy.\nTina: That's good for the environment.\nKota: Look! There's a walkway. Can we go up there?\nDavid: Sure. I'll show you the way. Every part of the city has wheelchair access.",
        "full_jp": "ティナ：これはすごいわ！ まるでSF映画みたい！ あなたのガイドブックを私に見せて、お願い。\nコウタ：はい、どうぞ。庭園は自分たちのエネルギーを作り出しているって書いてあるよ。\nデイビッド：「スーパーツリー」が太陽エネルギーを集めているんだ。\nティナ：それは環境に良いことね。\nコウタ：見て！ 歩道があるよ。あそこに上がれるかな？\nデイビッド：もちろん。僕が君たちに道を案内するよ。この街のあらゆる場所に車椅子のための通路があるんだ。",
        "vocab": [
          "amazing (驚くべき/すごい)",
          "science fiction (空想科学/SF)",
          "guidebook (ガイドブック)",
          "produce (生産する/作り出す)",
          "energy (エネルギー)",
          "collect (集める)",
          "environment (環境)",
          "access (アクセス/利用できること)"
        ],
        "grammar": "【SVOO (人に物を～する)】動詞の後ろに「人＋物」を続けることで、「人に物を～する」という意味になります。例：Show me your guidebook.",
        "ox_quiz": [
          {
            "q_en": "The Supertrees in the garden collect solar energy.",
            "q_jp": "庭園のスーパーツリーは太陽エネルギーを集めていますか？",
            "a": "〇",
            "exp": "はい。スーパーツリーが太陽エネルギーを集めているとデイビッドが説明しています。"
          },
          {
            "q_en": "There is no wheelchair access in the city.",
            "q_jp": "この街には車椅子用の通路はありませんか？",
            "a": "×",
            "exp": "いいえ。あらゆる場所に車椅子用の通路（wheelchair access）があると述べられています。"
          }
        ]
      },
      {
        "partTitle": "Part 3: ほら見て！",
        "en": "They visit Sultan Mosque on Arab Street. Kota tells them about the rules for visitors, such as covering shoulders and knees. Since Tina's shoulders were showing, David suggests that she can borrow clothes there.",
        "jp": "3人はアラブストリートにあるサルタン・モスクを訪れます。コウタは肩や膝を覆うといった、訪問者のためのルールを伝えます。ティナの肩が出ていたので、デイビッドは向こうで服を借りることができると教えます。",
        "full_en": "David: This is Arab Street, Kampong Gelam.\nKota: Is that a mosque? Do you want to look inside?\nTina: Yes. It's beautiful.\nKota: There are some rules for visitors. We need to cover our shoulders and knees.\nTina: Oh, I can't go in with you. Look at me.\nDavid: You need something to cover your shoulders, right?\nKota: You can wear my hoodie. Here!\nDavid: There's no need for that. You can borrow clothes to cover yourself over there.\nTina: Oh, really? Thanks, Kota, but I'm OK.",
        "full_jp": "デイビッド：ここがアラブストリート、カンポン・グラムだよ。\nコウタ：あれはモスク？ 中を見てみたい？\nティナ：ええ。美しいわ。\nコウタ：訪問者のためのルールがいくつかあるよ。僕たちは肩と膝を覆う必要があるんだ。\nティナ：あら、私あなたたちと一緒に入れないわ。私を見て。\nデイビッド：君は肩を覆うための何かが必要だね、でしょ？\nコウタ：僕のパーカーを着ていいよ。はい！\nデイビッド：その必要はないよ。向こうで、体を覆うための服を借りることができるよ。\nティナ：あら、本当？ ありがとうコウタ、でも大丈夫よ。",
        "vocab": [
          "mosque (モスク)",
          "rule (ルール/規則)",
          "shoulder (肩)",
          "knee (膝)",
          "cover (覆う/隠す)",
          "clothes (服)",
          "borrow (借りる)"
        ],
        "grammar": "【不定詞の形容詞的用法】名詞の後に「to + 動詞の原形」を置くことで、「〜するための/〜すべき」と名詞を説明します。例：something to cover.",
        "ox_quiz": [
          {
            "q_en": "Visitors to the mosque need to cover their shoulders.",
            "q_jp": "モスクの訪問者は肩を覆う必要がありますか？",
            "a": "〇",
            "exp": "はい。「肩と膝を覆う必要がある」というルールがあります。"
          },
          {
            "q_en": "Tina borrowed Kota's hoodie to enter the mosque.",
            "q_jp": "ティナはモスクに入るためにコウタのパーカーを借りましたか？",
            "a": "×",
            "exp": "いいえ。コウタの提案に対し、「大丈夫よ」と言って断っています。服は向こうで借りられます。"
          }
        ]
      },
      {
        "partTitle": "Goal: おすすめの一皿",
        "en": "Singapore offers various delicious dishes. Chicken Rice is good for a quick lunch, while Katong Laksa has rice noodles in spicy soup. Tina wants lunch on Arab Street and David wants rice noodles, so Prawn Mee is the best choice for them.",
        "jp": "シンガポールにはさまざまな美味しい料理があります。チキンライスは手早いランチに向いており、カトン・ラクサはスパイシーなスープに米粉の麺が入っています。アラブストリートでランチをしたいティナと、米粉の麺が食べたいデイビッドには、プロウン・ミーが最適です。",
        "full_en": "Chicken Rice: Good for a quick lunch.\nLaksa: Rice noodles in spicy coconut milk soup.\nPrawn Mee: You can choose yellow noodles or rice noodles. It has big shrimps.\nMurtabak: Spicy omelet pancake with vegetables.\nTina and David are looking for a place to eat on Arab Street. David wants rice noodles, so Prawn Mee is a good option because you can choose the noodles.",
        "full_jp": "チキンライス：手早くランチをするのに良いです。\nラクサ：スパイシーなココナッツミルクのスープに入った米粉の麺です。\nプロウン・ミー：黄色い麺か米粉の麺を選べます。大きなエビが入っています。\nムルタバ：野菜が入ったスパイシーなオムレツパンケーキです。\nティナとデイビッドはアラブストリートで食べる場所を探しています。デイビッドは米粉の麺を望んでいるので、麺が選べるプロウン・ミーが良い選択肢です。",
        "vocab": [
          "dish (料理/皿)",
          "quick (素早い)",
          "spicy (辛い/スパイスの効いた)",
          "mixture (混合)",
          "choose (選ぶ)",
          "shrimp (小エビ)"
        ],
        "grammar": "【不定詞の形容詞的用法の応用】「something to eat」や「place to eat」など、観光ガイドや日常会話でよく使われる表現を学びます。",
        "ox_quiz": [
          {
            "q_en": "Laksa has rice noodles in spicy coconut milk soup.",
            "q_jp": "ラクサはスパイシーなココナッツミルクのスープの中に米粉の麺が入っていますか？",
            "a": "〇",
            "exp": "はい。ラクサはそのような料理であると説明されています。"
          },
          {
            "q_en": "Tina and David decided to eat Murtabak.",
            "q_jp": "ティナとデイビッドはムルタバを食べることに決めましたか？",
            "a": "×",
            "exp": "いいえ。二人の希望（アラブストリート、米粉の麺）に合うのはプロウン・ミー（Prawn Mee）です。"
          }
        ]
      }
    ]
  },
  
"unit5": {
    "title": "Unit 5: How Do We Stay Safe? (どうやって安全を確保するか？)",
    "parts": [
      {
        "partTitle": "Part 1: みんなで考えよう",
        "en": "Tina, Kota, and Hajin are talking about a safety poster for natural disasters. Kota's family has emergency bags, and Tina's family has them, too. Eri says they must check the location of the evacuation shelters in advance and they must not forget to include that information.",
        "jp": "ティナ、コウタ、ハジンは自然災害の防災ポスターについて話し合っています。コウタの家には非常用持ち出し袋があり、ティナの家にもあります。エリは、事前に避難所の場所を確認しなければならないこと、そしてその情報をポスターに含めるのを忘れてはいけないと言います。",
        "full_en": "Tina: There are different types of natural disasters in Japan. Let's make a helpful poster in English.\nKota: Is your family prepared for natural disasters?\nHajin: We have emergency bags.\nTina: We have them, too.\nEri: That's good. Also, you must check the location of the evacuation shelters. When we can't stay home, we can stay at schools or community centers.\nKota: We must not (mustn't) forget to include information about shelters.",
        "full_jp": "ティナ：日本にはさまざまな種類の自然災害があります。英語で役に立つポスターを作りましょう。\nコウタ：あなたの家族は自然災害への備えはできている？\nハジン：僕たちは非常用持ち出し袋（防災バッグ）を持っているよ。\nティナ：うちも持っているわ。\nエリ：それはいいね。また、あなたは避難所の場所を確認しなければなりません。家にいられないときは、学校や公民館に滞在できます。\nコウタ：私たちはシェルター（避難所）についての情報を含めることを忘れてはいけません。",
        "vocab": [
          "natural disaster (自然災害)",
          "prepare (準備する)",
          "emergency (非常事態/緊急)",
          "location (場所/位置)",
          "evacuation shelter (避難所)",
          "include (含む)"
        ],
        "grammar": "【助動詞 must】must + 動詞の原形で「～しなければならない」という強い義務を表します。否定形の must not は「～してはいけない」という禁止を意味します。",
        "ox_quiz": [
          {
            "q_en": "Eri says that people can stay at community centers during disasters.",
            "q_jp": "エリは災害時に公民館に滞在できると言っていますか？",
            "a": "〇",
            "exp": "はい。エリが「学校や公民館に滞在できます」と述べています。"
          },
          {
            "q_en": "Kota says they must forget to include information about shelters.",
            "q_jp": "コウタは、避難所の情報を含めるのを忘れるべきだと言っていますか？",
            "a": "×",
            "exp": "いいえ。「忘れてはいけない（must not forget）」と言っています。"
          }
        ]
      },
      {
        "partTitle": "Part 2: 必要なことは",
        "en": "This part explains what to do when an earthquake or typhoon occurs. During an earthquake, you have to protect your head first. In some cases, you don't have to evacuate, but you have to stay home. It depends on your situation.",
        "jp": "このパートでは、地震や台風が起きたときに何をすべきかを説明しています。地震のときは、まず頭を守らなければなりません。場合によっては避難する必要はなく、家にいなければならないこともあります。それは状況によります。",
        "full_en": "When an earthquake occurs, you have to protect your head first. These actions can save lives: Drop, Cover, Hold on.\nWhen typhoons, heavy rain, or tsunamis occur: In some cases, you don't have to evacuate. Sometimes you have to stay home. It depends on your situation. Evacuate early if necessary.",
        "full_jp": "地震が起きた時、あなたはまず頭を守らなければなりません。これらの行動が命を救います：低くして、覆って、つかまる。\n台風、大雨、または津波が起きた時：場合によっては、あなたは避難する必要はありません。時々、家にいなければならないこともあります。それはあなたの状況によります。もし必要なら、早く避難してください。",
        "vocab": [
          "occur (起こる)",
          "protect (守る)",
          "save (救う)",
          "life (命)",
          "case (場合)",
          "evacuate (避難する)",
          "depend on (～による)",
          "necessary (必要な)"
        ],
        "grammar": "【have to】「～しなければならない」という義務・必要性を表します。否定文の don't have to は「～する必要はない（〜しなくてもよい）」という不必要を意味します。",
        "ox_quiz": [
          {
            "q_en": "You have to protect your head first during an earthquake.",
            "q_jp": "地震のとき、まず頭を守らなければなりませんか？",
            "a": "〇",
            "exp": "はい。「まず頭を守らなければならない（protect your head first）」と書かれています。"
          },
          {
            "q_en": "Don't have to evacuate means you must stay in the house.",
            "q_jp": "「避難する必要はない」は、必ず家にいなければならないという意味ですか？",
            "a": "×",
            "exp": "いいえ。「避難しなくてもよい（不必要）」という意味であり、禁止や強制ではありません。"
          }
        ]
      },
      {
        "partTitle": "Part 3: 今日からできること",
        "en": "Ms. Rios, Tina, and Nick are checking their emergency bag. Ms. Rios says it is important to prepare well for emergencies. Tina thinks they don't have to bring everything, so they have to choose the items carefully.",
        "jp": "リオスさん、ティナ、ニックは非常用持ち出し袋を点検しています。リオスさんは、緊急事態に備えてよく準備しておくことは重要だと言います。ティナは全部持っていく必要はないと考えているので、慎重にアイテムを選ばなければなりません。",
        "full_en": "Ms. Rios: Here is a pamphlet about preparing for natural disasters. Let's check the contents of the bag again. It is important to prepare well for emergencies.\nTina: Let's see. We have a flashlight, a radio, a map, canned food, and water. Oh, and don't forget cat food for Felix.\nNick: And cookies?\nTina: OK, but I don't think you have to bring them all.",
        "full_jp": "リオスさん：ここに自然災害への備えについてのパンフレットがあります。もう一度バッグの中身をチェックしましょう。緊急事態に備えてよく準備しておくことは重要です。\nティナ：ええと。懐中電灯、ラジオ、地図、缶詰、そして水があります。ああ、それとフェリックス（飼い猫）のためのキャットフードも忘れないで。\nニック：クッキーは？\nティナ：いいけど、それら全部を持っていく必要はないと思うわ。",
        "vocab": [
          "content (中身/内容)",
          "flashlight (懐中電灯)",
          "canned food (缶詰食品)",
          "forget (忘れる)",
          "bring (持っていく)"
        ],
        "grammar": "【It is ... to ～】仮の主語 It を使い、「～することは…だ」という文を作ります。本当の主語（to以下）を後ろに置く形式です。",
        "ox_quiz": [
          {
            "q_en": "Tina thinks that they must bring every item in the bag.",
            "q_jp": "ティナはバッグの中身を全部持っていかなければならないと考えていますか？",
            "a": "×",
            "exp": "いいえ。「それら全部を持っていく必要はないと思う（don't have to bring them all）」と言っています。"
          },
          {
            "q_en": "They have items like a flashlight and a radio in the bag.",
            "q_jp": "バッグの中に懐中電灯やラジオなどのアイテムは入っていますか？",
            "a": "〇",
            "exp": "はい。ティナが中身を確認する場面でそれらを挙げています。"
          }
        ]
      },
      {
        "partTitle": "Goal: 防災バッグの中身を決めよう",
        "en": "Students discuss essential items for disasters. Water is needed for drinking and cooking. A charger is necessary to contact family. Coins are also important because electronic money cannot be used when the power is down.",
        "jp": "生徒たちが災害時に不可欠なアイテムについて話し合っています。水は飲むだけでなく、料理にも必要です。家族と連絡を取るために充電器が必要です。停電中は電子マネーが使えないため、小銭も重要です。",
        "full_en": "1. Water: You can drink it. You can wash your face and hands with it. You need it when you cook.\n2. A charger: You have to get in touch with your family. You can't use a smartphone without electricity.\n3. Coins and a wallet: You can't use prepaid cards or electronic money when the power is down.",
        "full_jp": "1. 水：飲むことができる。顔や手を洗える。料理の時にも必要。\n2. 充電器：家族と連絡を取らなければならない。電気がないとスマホが使えない。\n3. 小銭と財布：停電中はプリペイドカードや電子マネーが使えないから。",
        "vocab": [
          "electricity (電気)",
          "get in touch with (～と連絡を取る)",
          "power (電力/電源)",
          "without (～なしで)"
        ],
        "grammar": "【重要表現の活用】have to（義務）や can't（不可能）、without（〜なしで）などの表現を使い、なぜそのアイテムが必要なのかを説明します。",
        "ox_quiz": [
          {
            "q_en": "Electronic money may not work during a power outage.",
            "q_jp": "停電中は電子マネーが使えないことがありますか？",
            "a": "〇",
            "exp": "はい。停電中（when the power is down）は電子マネーなどは使えないと説明されています。"
          },
          {
            "q_en": "Water is useful for many things like washing hands.",
            "q_jp": "水は手を洗うことなど、多くのことに役立ちますか？",
            "a": "〇",
            "exp": "はい。飲料用だけでなく、洗顔や手洗い、料理にも役立ちます。"
          }
        ]
      }
    ]
  },

"unit6": {
    "title": "Unit 6: Guide Dogs (盲導犬)",
    "parts": [
      {
        "partTitle": "Part 1: 盲導犬って？",
        "en": "Kota meets Fred and his guide dog Coco. He learns guide dogs are working to help people and shouldn't be petted. Fred explains Coco warns him of corners and steps. He asks people to pay attention to guide dog users because they might need help.",
        "jp": "コウタはフレッドと盲導犬のココに出会います。盲導犬は人を助けるために働いており、仕事中になでてはいけないことを学びます。フレッドは、ココが曲がり角や段差を教えてくれると説明し、手助けが必要な場合もあるのでユーザーにも注意を払ってほしいと伝えます。",
        "full_en": "Ms. Thusi: Hi, Kota! This is my friend Fred.\nKota: Nice to meet you. You have a dog. Can I pet him?\nMs. Thusi: I'm sorry, but you can't. She is a guide dog, and she is working now. She's here to help Fred.\nFred: Well, I'm visually impaired. Coco walks with me to my destination. She warns me about corners and steps. If you see a guide dog with someone, please pay attention to the person, too. They might need assistance from you.",
        "full_jp": "ツシ先生：やあ、コウタ！ こちらは私の友人のフレッドです。\nコウタ：はじめまして。犬を連れていますね。彼をなでてもいいですか？\nツシ先生：ごめんなさい、できないの。彼女は盲導犬で、今は仕事中なのよ。彼女はフレッドを助けるためにここにいます。\nフレッド：ええと、僕は視覚に障害があるんだ。ココ（犬の名前）は目的地まで僕と一緒に歩いてくれるんだよ。彼女は曲がり角や段差を僕に教えてくれるんだ。もし誰かと一緒にいる盲導犬を見かけたら、その人にも注意を払ってください。彼らはあなたからの手助けを必要としているかもしれません。",
        "vocab": [
          "guide dog (盲導犬)",
          "pet (なでる)",
          "visually impaired (視覚障害のある)",
          "destination (目的地)",
          "corner (曲がり角)",
          "pay attention to (～に注意を払う)",
          "assistance (手助け/援助)"
        ],
        "grammar": "【不定詞の副詞的用法 (目的)】to + 動詞の原形 で、「～するために」という動作の目的を表します。例：She's here to help Fred.",
        "ox_quiz": [
          {
            "q_en": "Kota can pet the dog because she is very cute.",
            "q_jp": "その犬はとてもかわいいので、コウタはなでることができますか？",
            "a": "×",
            "exp": "いいえ。仕事中の盲導犬（working now）はなでてはいけません。"
          },
          {
            "q_en": "Coco helps Fred by warning him about corners and steps.",
            "q_jp": "ココは曲がり角や段差を教えることでフレッドを助けていますか？",
            "a": "〇",
            "exp": "はい。ココはフレッドが安全に歩けるように角や段差を知らせます。"
          }
        ]
      },
      {
        "partTitle": "Part 2: 盲導犬の一生",
        "en": "Future guide dogs live with puppy walkers for 10 months to learn social rules and be comfortable with people. At one year old, they train for a year at a center and must pass tests. They work for eight years and then retire.",
        "jp": "将来の盲導犬は、社会のルールを学び人とリラックスして過ごせるようになるために、10か月間パピーウォーカーと暮らします。1歳になると訓練センターで1年間訓練を受け、テストに合格しなければなりません。彼らは8年間働いてから引退します。",
        "full_en": "Future guide dogs live with a volunteer family: \"puppy walkers.\" As puppies, they spend ten months of their lives with puppy walkers. They need to learn to be comfortable with people. They also learn basic social rules because it's essential for guide dogs. When the dogs are one year old, they go to the training center. They train for about a year. They have to pass some tests before they can work as guide dogs. After eight years, they retire.",
        "full_jp": "将来の盲導犬は、「パピーウォーカー」と呼ばれるボランティアの家族と暮らします。子犬として、彼らは人生の10か月をパピーウォーカーと過ごします。彼らは人と一緒にいて快適でいる（リラックスする）ことを学ぶ必要があります。盲導犬にとって必要不可欠なので、彼らは基本的な社会のルールも学びます。犬たちが1歳になると、彼らは訓練センターへ行きます。彼らは約1年間訓練します。盲導犬として働けるようになる前に、いくつかのテストに合格しなければなりません。8年後、彼らは引退します。",
        "vocab": [
          "volunteer (ボランティア)",
          "spend (過ごす/費やす)",
          "comfortable (心地よい/気楽な)",
          "basic (基本的な)",
          "social (社会の)",
          "essential (必要不可欠な)",
          "pass (合格する)",
          "retire (引退する)"
        ],
        "grammar": "【接続詞 because】because + 文 で、「なぜなら～だから」という理由を説明します。例：... because it's essential for guide dogs.",
        "ox_quiz": [
          {
            "q_en": "Puppies spend ten months with puppy walkers.",
            "q_jp": "子犬はパピーウォーカーと10か月間過ごしますか？",
            "a": "〇",
            "exp": "はい。人生の10か月間（ten months）をパピーウォーカーと過ごします。"
          },
          {
            "q_en": "Guide dogs start working at one year old without any training.",
            "q_jp": "盲導犬は訓練なしに1歳で働き始めますか？",
            "a": "×",
            "exp": "いいえ。1歳から訓練センターで約1年間訓練を受け、テストに合格する必要があります。"
          }
        ]
      },
      {
        "partTitle": "Part 3: Kotaがやってみたいこと",
        "en": "Kota is interested in guide dogs and wants to learn more. Tina suggests he should become a puppy walker to have a good experience. Ms. Thusi is glad to hear his interest and advises him to talk to his parents.",
        "jp": "コウタは盲導犬に興味を持ち、もっと知りたいと思っています。ティナは良い経験になるのでパピーウォーカーになってはどうかと提案します。ツシ先生は彼の興味を喜び、それについて両親と話すべきだと助言します。",
        "full_en": "Ms. Thusi: What are you looking at?\nKota: A website about guide dogs. I want to know more about guide dogs now.\nMs. Thusi: I'm glad to hear that.\nKota: According to the website, people can become \"puppy walkers\" and raise future guide dogs.\nTina: Why don't you become a puppy walker?\nKota: Really? I like dogs, but... do you think I can be one?\nTina: I think so. It'll be a good experience for you.\nMs. Thusi: You should talk to your parents about it.",
        "full_jp": "ツシ先生：何を見ているの？\nコウタ：盲導犬についてのウェブサイトです。僕は今、盲導犬についてもっと知りたいんです。\nツシ先生：それを聞いてうれしいわ。\nコウタ：ウェブサイトによると、人々は「パピーウォーカー」になって、将来の盲導犬を育てることができるそうです。\nティナ：あなたがパピーウォーカーになったらどう？\nコウタ：本当？ 犬は好きだけど…僕がなれると思う？\nティナ：そう思うわ。あなたにとって良い経験になるでしょう。\nツシ先生：それについてご両親と話すべきですね。",
        "vocab": [
          "glad (うれしい)",
          "according to (～によると)",
          "raise (育てる)",
          "experience (経験)",
          "should (～すべきだ)",
          "parents (両親)"
        ],
        "grammar": "【不定詞の副詞的用法 (原因)】形容詞 + to + 動詞の原形 で、「～して（うれしいなど）」という感情の原因を表します。例：I'm glad to hear that.",
        "ox_quiz": [
          {
            "q_en": "Kota learned about puppy walkers from a website.",
            "q_jp": "コウタはウェブサイトからパピーウォーカーについて知りましたか？",
            "a": "〇",
            "exp": "はい。「ウェブサイトによると...」とパピーウォーカーについて話しています。"
          },
          {
            "q_en": "Ms. Thusi says Kota doesn't have to talk to his parents.",
            "q_jp": "ツシ先生は、コウタは両親と話す必要はないと言っていますか？",
            "a": "×",
            "exp": "いいえ。「ご両親と話すべき（should talk to your parents）」と言っています。"
          }
        ]
      },
      {
        "partTitle": "Goal: ボランティア活動の紹介",
        "en": "In the school paper, Kota introduces a group that rescues and cares for dogs in shelters. They provide food, walks, and baths. They look for new families because dogs need homes and love. Kota joined them last Saturday and had fun.",
        "jp": "学校新聞で、コウタはシェルターで犬を救助し世話をするグループを紹介しています。彼らは餌やりや散歩、体を洗う活動をしています。犬には家と愛が必要なため、新しい家族も探しています。コウタは先週の土曜日に参加し、楽しみました。",
        "full_en": "I'm going to introduce a volunteer group. It's a group to rescue dogs and take care of them in shelters. One day, when I was looking up some information about dogs, I learned about this group. They feed them, walk them, and wash their bodies. They also look for new families because dogs need a home and people's love. I joined the group and worked with them last Saturday. It was hard, but fun.",
        "full_jp": "僕はボランティアグループを紹介します。それは犬を救助し、シェルター（保護施設）で彼らの世話をするグループです。ある日、僕が犬についての情報を調べていた時、このグループについて知りました。彼らは犬に餌をやり、散歩させ、体を洗います。彼らは新しい家族も探しています。なぜなら犬には家と人々の愛が必要だからです。僕は先週の土曜日、グループに参加して彼らと一緒に活動しました。大変だったけど楽しかったです。",
        "vocab": [
          "rescue (救助する)",
          "take care of (～の世話をする)",
          "look up (～を調べる)",
          "feed (餌をやる)",
          "look for (～を探す)"
        ],
        "grammar": "【because の活用】理由を説明する because を使い、なぜ新しい家族を探しているのか（家と愛が必要だから）という根拠を伝えます。",
        "ox_quiz": [
          {
            "q_en": "The volunteer group looks for new families for the dogs.",
            "q_jp": "ボランティアグループは犬のために新しい家族を探していますか？",
            "a": "〇",
            "exp": "はい。「新しい家族も探しています（look for new families）」と書かれています。"
          },
          {
            "q_en": "Kota joined the volunteer work last Sunday.",
            "q_jp": "コウタは先週の日曜日にボランティア活動に参加しましたか？",
            "a": "×",
            "exp": "いいえ。先週の「土曜日（last Saturday）」に参加しました。"
          }
        ]
      }
    ]
  },
  
"unit7": {
    "title": "Unit 7: Working Together (協力して作る物語)",
    "parts": [
      {
        "partTitle": "Part 1: 企画会議",
        "en": "Tina and Eri are talking about the Honcho International Festival. Tina says it is the biggest event of the year and bigger than the summer festival. Eri thinks a play is easier than a musical. They decide to write a science fiction drama.",
        "jp": "ティナとエリが「本町インターナショナルフェスティバル」について話し合っています。ティナはそれが一年で最大のイベントであり、夏祭りよりも大きいと言います。エリは劇の方がミュージカルよりも簡単だと思っており、彼女たちはSFドラマを書くことにしました。",
        "full_en": "Tina: The Honcho International Festival is coming soon. This festival is bigger than the Honcho Summer Festival. It's the biggest event of the year. It may sound crazy, but should we try a musical?\nEri: That's too difficult. I think a play is easier than a musical. The theme is friendship. Any good ideas for the story?\nTina: I want to try a science fiction drama.\nEri: Let's try brainstorming. It's the best way to come up with good ideas.",
        "full_jp": "ティナ：本町インターナショナルフェスティバルがもうすぐやってくるわ。このお祭りは、本町夏祭りよりも大きいのよ。一年の中で最も大きなイベントだわ。馬鹿げているように聞こえるかもしれないけど、ミュージカルをやってみるべきじゃない？\nエリ：それは難しすぎるわ。私は劇のほうがミュージカルよりも簡単だと思うわ。テーマは「友情」よ。物語について何か良いアイデアはある？\nティナ：私はSFドラマに挑戦したいわ。\nエリ：ブレインストーミングをしてみましょう。それが良いアイデアを思いつくための最も良い方法よ。",
        "vocab": [
          "festival (祭り)",
          "musical (ミュージカル)",
          "play (劇)",
          "script (台本)",
          "theme (テーマ)",
          "friendship (友情)",
          "brainstorming (ブレインストーミング)",
          "come up with (～を思いつく)"
        ],
        "grammar": "【比較級・最上級 (-er / -est)】「bigger than（～より大きい）」や「the biggest（最も大きい）」など、形容詞や副詞に er/est をつけて比較を表します。",
        "ox_quiz": [
          {
            "q_en": "The Summer Festival is bigger than the International Festival.",
            "q_jp": "夏祭りはインターナショナルフェスティバルよりも大きいですか？",
            "a": "×",
            "exp": "いいえ。「インターナショナルフェスティバルの方が夏祭りよりも大きい」と説明されています。"
          },
          {
            "q_en": "Eri thinks a play is easier than a musical.",
            "q_jp": "エリは劇の方がミュージカルよりも簡単だと考えていますか？",
            "a": "〇",
            "exp": "はい。エリは「劇のほうがミュージカルよりも簡単だ（easier than a musical）」と言っています。"
          }
        ]
      },
      {
        "partTitle": "Part 2: 二人の自信作",
        "en": "Tina finished the original script. The story takes place on a spaceship. Kota plays Jonathan and Hajin plays an android. Tina says a school in space is more exciting than a normal school. Eri says teamwork is the most important thing.",
        "jp": "ティナがオリジナルの台本を完成させました。物語は宇宙船の中で進みます。コウタはジョナサン役、ハジンはアンドロイド役です。ティナは宇宙の学校は普通の学校よりもワクワクすると言い、エリはチームワークが最も重要だと話します。",
        "full_en": "Tina: Look, everyone. The script for our original play. Kota, you are Jonathan. Hajin, you are F15. You are an android. The story takes place on a spaceship.\nKota: I thought it was about school life.\nTina: Yes, but a school in space is more exciting than a normal one.\nEri: Don't worry. We have time to prepare. Teamwork is the most important thing, everyone.",
        "full_jp": "ティナ：見て、みんな。私たちのオリジナルの劇の台本よ。コウタ、あなたはジョナサン役よ。ハジン、あなたはF15。あなたはアンドロイド（人造人間）よ。物語は宇宙船の中で進んでいくの。\nコウタ：僕は学校生活についての劇だと思っていたよ。\nティナ：ええ、でも宇宙にある学校は、普通の学校よりももっとワクワクするわ。\nエリ：心配しないで。準備する時間はあります。チームワークは最も重要なことよ、みんな。",
        "vocab": [
          "original (オリジナルの)",
          "android (アンドロイド/人造人間)",
          "spaceship (宇宙船)",
          "normal (普通の)",
          "teamwork (チームワーク)",
          "prepare (準備する)",
          "exciting (ワクワクさせる)",
          "important (重要な)"
        ],
        "grammar": "【比較級・最上級 (more / most)】exciting や important のような長い単語は、前に more や the most を置いて比較を表します。",
        "ox_quiz": [
          {
            "q_en": "The story takes place on a spaceship.",
            "q_jp": "物語は宇宙船の中で行われますか？",
            "a": "〇",
            "exp": "はい。物語の舞台は宇宙船（spaceship）です。"
          },
          {
            "q_en": "Hajin is going to play the role of a normal student.",
            "q_jp": "ハジンは普通の生徒の役を演じる予定ですか？",
            "a": "×",
            "exp": "いいえ。ハジンはアンドロイド（android）の役を演じます。"
          }
        ]
      },
      {
        "partTitle": "Part 3: 本番2日前",
        "en": "Everyone is tired during practice. Kota blows his lines, and Eri says they are all as tired as he is. Hajin says they are trying as hard as anybody else. He thinks the script is the problem, but Eri thinks his acting is the problem.",
        "jp": "練習中、みんな疲れています。コウタはセリフを飛ばしてしまい、エリはみんなコウタと同じくらい疲れていると言います。ハジンは他の誰にも負けないくらい一生懸命やっていると言い、台本が問題だと言いますが、エリはハジンの演技が問題だと言い返します。",
        "full_en": "Eri: You blew your lines again.\nKota: Sorry, but too many lines. I can't remember them.\nHajin: Let's take a break. Kota is overworked.\nEri: We all are as tired as Kota. But we need to do it again now.\nHajin: We are trying as hard as anybody else. Maybe the script is the problem.\nEri: What did you say? Maybe your acting is the problem.\nTina: Hey, calm down, you two.",
        "full_jp": "エリ：あなた、またセリフを飛ばしたわね。\nコウタ：ごめん、でもセリフが多すぎるよ。覚えられないんだ。\nハジン：休憩しようよ。コウタは働きすぎ（頑張りすぎ）だよ。\nエリ：私たちだってみんな、コウタと同じくらい疲れているわ。でも今はもう一度やる必要があるの。\nハジン：僕たちは他の誰とも同じくらい一生懸命やっているよ。たぶん、台本が問題なんじゃないかな。\nエリ：なんて言ったの？ たぶん、あなたの演技が問題なんじゃない？\nティナ：ちょっと、二人とも落ち着いて。",
        "vocab": [
          "blow lines (セリフを飛ばす)",
          "remember (覚えている)",
          "take a break (休憩する)",
          "overworked (働きすぎの)",
          "tired (疲れた)",
          "anybody else (他の誰か)",
          "acting (演技)",
          "calm down (落ち着く)"
        ],
        "grammar": "【原級比較 (as ... as)】「as + 形容詞/副詞 + as ...」で「...と同じくらい～だ」という意味を表します。例：as tired as Kota。",
        "ox_quiz": [
          {
            "q_en": "Eri thinks the script is the main problem.",
            "q_jp": "エリは台本が主な問題だと思っていますか？",
            "a": "×",
            "exp": "いいえ。エリは「ハジンの演技（acting）が問題だ」と言っています。"
          },
          {
            "q_en": "Hajin thinks Kota should continue practicing without a break.",
            "q_jp": "ハジンはコウタが休憩なしで練習を続けるべきだと考えていますか？",
            "a": "×",
            "exp": "いいえ。「休憩しよう（Let's take a break）」と提案しています。"
          }
        ]
      },
      {
        "partTitle": "Goal: ポスターのプレゼン",
        "en": "Three students present their poster designs. Hajin's poster has the biggest picture and is the most eye-catching. Tina's poster is the most colorful. Eri's poster has the largest letters and is the easiest to understand.",
        "jp": "3人の生徒がポスターのデザインを発表しています。ハジンのポスターは最も大きな絵があり、最も目を引きます。ティナのポスターは最もカラフルです。エリのポスターは最も大きな文字を使い、最も理解しやすいです。",
        "full_en": "Hajin's Poster: It uses the biggest picture of two astronauts. It is the most eye-catching poster.\nTina's Poster: It is the most colorful of all. It expresses excitement.\nEri's Poster: It uses the largest letters for 'Cooperation.' It is the easiest to understand.",
        "full_jp": "ハジンのポスター：2人の宇宙飛行士の最も大きな絵を使っています。一番目を引くポスターです。\nティナのポスター：すべての中で最もカラフルです。ワクワク感を表現しています。\nエリのポスター：「協力（Cooperation）」という文字に最も大きな文字を使っています。一番理解しやすいです。",
        "vocab": [
          "astronaut (宇宙飛行士)",
          "eye-catching (人目を引く)",
          "colorful (色彩豊かな)",
          "in addition (加えて)",
          "funny (おかしい)",
          "cooperation (協力)",
          "express (表現する)"
        ],
        "grammar": "【最上級のまとめ】「the -est」や「the most」を使った最上級の復習です。範囲を表す of や in を伴うことが多いです。",
        "ox_quiz": [
          {
            "q_en": "Hajin's poster is the most colorful of all.",
            "q_jp": "ハジンのポスターがすべての中で最もカラフルですか？",
            "a": "×",
            "exp": "いいえ。最もカラフルなのはティナのポスターです。"
          },
          {
            "q_en": "Eri's poster is the easiest to understand.",
            "q_jp": "エリのポスターは最も理解しやすいですか？",
            "a": "〇",
            "exp": "はい。大きな文字を使い、一番理解しやすい（easiest to understand）と説明されています。"
          }
        ]
      }
    ]
  },

"unit8": {
    "title": "Unit 8: Performing a Play (演劇の上演)",
    "parts": [
      {
        "partTitle": "Part 1: 昨日は…",
        "en": "The day after their argument, Tina asks Kota to help her so Hajin and Eri can be alone. Hajin and Eri apologize to each other for their bad attitude. They promise to do their best together.",
        "jp": "口論の翌日、ティナはハジンとエリを二人きりにするために、コウタに手伝いを頼みます。ハジンとエリは互いに謝り、一緒にベストを尽くすことを約束します。",
        "full_en": "Tina: Kota! I want you to help me. Come on! We need chairs.\nKota: What? But there are chairs here.\nTina: Different chairs. Come with me!\n(Tina pushes Kota out and they leave the room. Hajin and Eri are alone.)\nHajin: Sorry about yesterday. I didn't mean it about your script.\nEri: I understand. I'm sorry, too. I was too hard on you.\nHajin: That's OK. I really think we can be great if we try our best.\nEri: Yes, I'll do my best. I promise.",
        "full_jp": "ティナ：コウタ！ 私はあなたに私を手伝ってほしいの。 来て！ 椅子が必要なの。\nコウタ：え？ でもここに椅子はあるよ。\nティナ：違う椅子よ。私と一緒に来て！\n（ティナはコウタを押し出し、彼らは部屋を出る。ハジンとエリは二人きりになる。）\nハジン：昨日はごめん。君の台本について、あんなつもりじゃなかったんだ。\nエリ：わかっているわ。私の方こそごめんなさい。あなたに対して厳しすぎたわ。\nハジン：いいんだ。もし僕たちがベストを尽くせば、素晴らしいものになれると本当に思っているよ。\nエリ：ええ、ベストを尽くすわ。約束する。",
        "vocab": [
          "push (押す)",
          "leave (去る/出る)",
          "mean (本気で言う/意味する)",
          "hard on (～に厳しい)",
          "promise (約束する)",
          "try one's best (ベストを尽くす)"
        ],
        "grammar": "【want + 人 + to + 動詞の原形】「人」に「〜してほしい」と相手に行動を求める表現です。want to（自分が〜したい）との違いに注意しましょう。",
        "ox_quiz": [
          {
            "q_en": "Tina wanted Hajin and Eri to talk alone.",
            "q_jp": "ティナはハジンとエリを二人きりで話させたかったのですか？",
            "a": "〇",
            "exp": "はい。二人を仲直りさせるために、わざとコウタを部屋から連れ出しました。"
          },
          {
            "q_en": "Hajin meant to say bad things about the script.",
            "q_jp": "ハジンは本気で台本を悪く言うつもりでしたか？",
            "a": "×",
            "exp": "いいえ。「あんなつもりじゃなかった（I didn't mean it）」と謝っています。"
          }
        ]
      },
      {
        "partTitle": "Part 2: いよいよ本番",
        "en": "It is ten minutes before the performance. Kota is very nervous because he see many people in the audience. Tina is also a bit nervous, but she is excited about the play.",
        "jp": "劇の本番10分前です。コウタは観客席にたくさんの人がいるので、とても緊張しています。ティナも少し緊張していますが、劇にワクワクしています。",
        "full_en": "(10 minutes before the performance)\nKota: Tina, I can't find my space suit!\nTina: Don't worry. Eri is fixing it.\n(Eri brings the suit.)\nKota: Thanks! I thought I lost it. Hey, look! So many people in the audience! Aww. That makes me nervous.\nTina: Don't worry, we'll do fine. Actually, I'm a bit nervous, but it makes me excited.\nEri: OK. Get ready, everyone. We're on in five minutes.",
        "full_jp": "（本番10分前）\nコウタ：ティナ、僕の宇宙服が見つからないんだ！\nティナ：心配しないで。エリがそれを修理しているわ。\n（エリが宇宙服を持ってくる）\nコウタ：ありがとう！ 無くしたかと思ったよ。ねえ、見て！ 観客席にすごくたくさんの人がいる！ うわぁ。そのことが僕を緊張させるよ。\nティナ：心配しないで、私たちはうまくやるわ。実は私も少し緊張してるけど、それが私をワクワクさせるの。\nエリ：よし。みんな準備して。あと5分で出番よ。",
        "vocab": [
          "fix (修理する/直す)",
          "audience (観客)",
          "nervous (緊張して/不安な)",
          "fine (立派に/元気に)",
          "get ready (準備する)",
          "be on (出番で/上演中で)"
        ],
        "grammar": "【make + 人 + 形容詞】「人」を「〜の状態にさせる」という意味です。「〜のせいで...になる」という原因と結果を表す際によく使われます。",
        "ox_quiz": [
          {
            "q_en": "Kota's space suit was lost forever.",
            "q_jp": "コウタの宇宙服は永遠に失われてしまいましたか？",
            "a": "×",
            "exp": "いいえ。エリが修理しており、あとで持ってきました。"
          },
          {
            "q_en": "Kota feels nervous because of the many people in the audience.",
            "q_jp": "コウタは観客がとても多いので緊張していますか？",
            "a": "〇",
            "exp": "はい。「観客席にすごくたくさんの人がいる。それが僕を緊張させる」と言っています。"
          }
        ]
      },
      {
        "partTitle": "Part 3: 幕が下りたら",
        "en": "The play was successful. After the performance, Eri gives Hajin a spaceship made of chocolate for Valentine's Day. Hajin is very happy and wants to keep it as a treasure.",
        "jp": "劇は成功しました。上演後、エリはハジンにバレンタインとしてチョコレートで作られた宇宙船を渡します。ハジンはとても喜び、それを宝物としてとっておきたいと言います。",
        "full_en": "(After the performance)\nTina: We did it!\nHajin: Yeah! It was well received by everyone, I think.\nEri: Hajin, do you have a second? I have something for you. Happy Valentine's!\nHajin: For me? Wow! It's a spaceship!\nEri: It's our spaceship. It's made of chocolate. I hope you like it.\nHajin: I love it! Thanks. I'll keep it as a treasure.",
        "full_jp": "（上演後）\nティナ：やったわね！\nハジン：ああ！ それはみんなによく受け入れられた（好評だった）と思うよ。\nエリ：ハジン、ちょっと時間ある？ あなたにあげるものがあるの。ハッピーバレンタイン！\nハジン：僕に？ わあ！ 宇宙船だ！\nエリ：私たちの（劇の）宇宙船よ。それはチョコレートで作られているの。気に入ってくれるといいんだけど。\nハジン：大好きだよ！ ありがとう。宝物としてとっておくよ。",
        "vocab": [
          "receive (受け取る/受け入れる)",
          "second (少しの間/秒)",
          "made (makeの過去分詞)",
          "treasure (宝物)",
          "be well received (好評である)",
          "be made of (～でできている)"
        ],
        "grammar": "【受け身（受動態）】be動詞 + 過去分詞 で「〜される（された）」という意味になります。材料を表す場合は be made of を使います。",
        "ox_quiz": [
          {
            "q_en": "The spaceship from Eri was made of chocolate.",
            "q_jp": "エリからの宇宙船はチョコレートで作られていましたか？",
            "a": "〇",
            "exp": "はい。「それはチョコレートで作られている（It's made of chocolate）」と言っています。"
          }
        ]
      },
      {
        "partTitle": "Goal: 手紙の返事を書こう",
        "en": "Eri writes a letter to Hajin to apologize for her bad attitude. She felt pressure to improve their play. She wants to be good friends with Hajin forever.",
        "jp": "エリは自分の悪い態度を謝るためにハジンに手紙を書きます。彼女は劇を良くしようとプレッシャーを感じていたのです。彼女はハジンとずっと良い友達でいたいと思っています。",
        "full_en": "Dear Hajin,\nI would like to apologize to you for my bad attitude toward you. I know that you practiced hard, but I felt pressure to improve our play. To show my thanks, I made some chocolate. I hope we can be good friends forever.",
        "full_jp": "親愛なるハジンへ\nあなたに対する私の悪い態度について、謝りたいと思います。あなたが一生懸命練習していたのは知っているけど、私は劇を良くするためにプレッシャーを感じていたの。感謝を示すために、チョコレートを作りました。私たちがずっと良い友達でいられることを願っています。",
        "vocab": [
          "apologize (謝る)",
          "attitude (態度)",
          "toward (～に対して)",
          "pressure (重圧/プレッシャー)",
          "improve (良くする/改良する)",
          "forever (永遠に)"
        ],
        "grammar": "【Unit 8のまとめ】「人に〜してほしい（want 人 to）」や「人を〜の状態にする（make 人 形容詞）」、そして「〜される（受動態）」といった、感情や状態を伝える表現の総復習です。",
        "ox_quiz": [
          {
            "q_en": "Eri felt pressure because she wanted to improve the play.",
            "q_jp": "エリは劇を良くしたかったのでプレッシャーを感じていましたか？",
            "a": "〇",
            "exp": "はい。「劇を良くするためにプレッシャーを感じていた」と手紙に書いています。"
          },
          {
            "q_en": "Eri wants to stop being friends with Hajin.",
            "q_jp": "エリはハジンと友達でいるのをやめたいと思っていますか？",
            "a": "×",
            "exp": "いいえ。「ずっと良い友達でいられることを願っている」と書いています。"
          }
        ]
      }
    ]
  }
}



  
